software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertNewSpecimen.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <InsertRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject
                        activityStatus="Active"
                        availableQuantity="10.0"
                        barcode="Bar Code AAA - 300"
                        collectionStatus="Pending"
                        identifier="0"
                        initialQuantity="11.0"
                        isAvailable="true"
                        label="Label AAA - 300"
                        pathologicalStatus="Not Specified"
                        specimenClass="Fluid"
                        specimenType="Serum"
                        xsi:type="ns2:FluidSpecimen"
                        xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                        xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">

                    <ns2:specimenCharacteristics>
                        <ns2:SpecimenCharacteristics identifier="5" tissueSide="Left" tissueSite="Not Specified"/>
                    </ns2:specimenCharacteristics>

                    <ns2:specimenCollectionGroup>
                        <ns2:SpecimenCollectionGroup identifier="978"/>
                    </ns2:specimenCollectionGroup>

                </ns1:AbstractDomainObject>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>